app/views/offers/add.html.erb

    <!-- Display the items of the current user -->
      <% current_user.products.each do |p| %>
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = 1