app/views/offers/index.html.erb

SELECT "users".* FROM "users" INNER JOIN "offers_users" ON "users"."id" = "offers_users"."user_id" WHERE "offers_users"."offer_id" = 53 LIMIT 1
---
  <% @offers.each do |offer| %>
    <% if offer.users.first.email == current_user.email %>

SELECT "products".* FROM "products" INNER JOIN "offers_products" ON "products"."id" = "offers_products"."product_id" WHERE "offers_products"."offer_id" = 53
---
      <p>You offerred:</p>
      <% offer.products.each do |p| %>