app/controllers/application_controller.rb

SELECT "products".* FROM "products" WHERE (description like '%Babol%')
---
  def search
    @product_results = []
    @product_results = Product.where("name like ?", "%#{params[:search]}%")