app/controllers/home_controller.rb

SELECT "products".* FROM "products"
---
  def index
    prods = Product.where('available = ?', 'y')
    @products = []
    prods.each do |p|

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "products".* FROM "products" INNER JOIN "categories_products" ON "products"."id" = "categories_products"."product_id" WHERE "categories_products"."category_id" = 1
---
  def cat_show
    @products = Category.find(params[:id]).products