app/controllers/offers_controller.rb

  def add_first_item
    @product = Product.find(params[:id]);
    @offer = Offer.new
    @offer.products << @product
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "31"]]
INSERT INTO "offers" ("completed", "created_at", "initiated_by", "updated_at") VALUES (?, ?, ?, ?)  [["completed", "n"], ["created_at", Tue, 18 Mar 2014 11:18:33 UTC +00:00], ["initiated_by", "1"], ["updated_at", Tue, 18 Mar 2014 11:18:33 UTC +00:00]]

  def finalize_offer

    p_ids = params[:@offer][:product_ids]
    @offer = Offer.find(params[:id])
    @offer.products = []
    p_ids.each do |pid|
      @offer.products << Product.find(pid)
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", "68"]]
SELECT "products".* FROM "products" INNER JOIN "offers_products" ON "products"."id" = "offers_products"."product_id" WHERE "offers_products"."offer_id" = 68

  def accept #Make the swap of the items
    @offer = Offer.find(params[:id])
    user1 = @offer.users[0]
    user2 = @offer.users[1]
    user1_products = []
    user2_products = []
    @offer.products.each do |p|
      if p.user == user1
        user1_products << p
        #user1.products.find(p.id).delete
      else
        user2_products << p
        #user2.products.find(p.id).delete
      end
    end
    user1_products.each do |p|
      p.user = user2
      p.save
      user2.products << p
    end
    user2_products.each do |p|
      p.user = user1
      p.save
      user1.products << p
    end
    user1.save
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", "74"]]
SELECT "products".* FROM "products" INNER JOIN "offers_products" ON "products"."id" = "offers_products"."product_id" WHERE "offers_products"."offer_id" = 74
SELECT "users".* FROM "users" INNER JOIN "offers_users" ON "users"."id" = "offers_users"."user_id" WHERE "offers_users"."offer_id" = 74
UPDATE "offers" SET "completed" = 'y', "updated_at" = '2014-03-18 13:12:20.932100' WHERE "offers"."id" = 74
UPDATE "products" SET "user_id" = 2, "updated_at" = '2014-03-18 13:12:20.922228' WHERE "products"."id" = 37

  def show
    @offer = Offer.find(params[:id])
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", "index"]]

  def destroy
    @offer = Offer.find(params[:id])
    @offer.destroy
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = ? LIMIT 1  [["id", "68"]]
DELETE FROM "offers" WHERE "offers"."id" = ?  [["id", 68]]