app/controllers/products_controller.rb

  def index

    @products = current_user.products #.where('available = ?', 'y')
---
SELECT "products".* FROM "products" WHERE "products"."user_id" = 1

  def create

    @product = Product.new(params[:product])
    @product.available = 'y'
    @products = current_user.products
    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 09 Mar 2014 20:38:28 UTC +00:00], ["description", "e"], ["name", "e"], ["updated_at", Sun, 09 Mar 2014 20:38:28 UTC +00:00], ["user_id", nil]]