app/views/products/_form.html.erb

  </div>
  <% Category.all.each do |c| %>
---
SELECT "categories".* FROM "categories"

      <%= f.label c.name %> <br />
      <%= check_box_tag "product[category_ids][]", c.id, @product.categories.include?(@product) %>
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_products" ON "categories"."id" = "categories_products"."category_id" WHERE "categories_products"."product_id" IS NULL