app/views/products/_product.html.erb

  <p>Categories:</p>
  <% product.categories.each do |c| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "categories_products" ON "categories"."id" = "categories_products"."category_id" WHERE "categories_products"."product_id" = 8