app/views/products/show.html.erb


    <% elsif current_user.email != @product.user.email && @product.offers.count > 0 %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

    <% counter = 0 %>
    <% @product.images.each do |i| %>
---
SELECT "images".* FROM "images" WHERE "images"."product_id" = 37